cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'git-time-metric/gtm'
tap 'caskroom/fonts'

brew 'doctl'
brew 'git'
brew 'gtm'
brew 'hub'
brew 'jq'
brew 'keith/formulae/reminders-cli'
brew 'm-cli'
brew 'mas'
brew 'ripgrep'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'

cask '1password'
cask 'appcleaner'
cask 'betterzipql'
cask 'caffeine'
cask 'dbglass'
cask 'devdocs'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'google-chrome'
cask 'grammarly'
cask 'hyper'
<<<<<<< HEAD
cask 'iterm'
=======
cask 'iterm2'
>>>>>>> 5858eabb3af5149e2052546ed5b6a7c79a123e0e
cask 'kap'
cask 'skitch'
cask 'plug'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'sketch'
cask 'skitch'
cask 'slack'
cask 'spectacle'
cask 'steam'
cask 'suspicious-package'
<<<<<<< HEAD
cask 'transmission'
=======
>>>>>>> 5858eabb3af5149e2052546ed5b6a7c79a123e0e
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'xscope'


