cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'chclaus/dt', 'git@github.com:chclaus/dt.git'

brew 'bat'
brew 'csvkit'
brew 'dt'
brew 'doctl'
brew 'fzf'
brew 'git'
brew 'golang'
brew 'hub'
brew 'jq'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'keith/formulae/reminders-cli'
brew 'm-cli'
brew 'mas'
brew 'multimarkdown'
brew 'nteract'
brew 'pianobar'
brew 'ripgrep'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'z'

cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'avibrazil-rdm'
cask 'betterzipql'
cask 'caffeine'
cask 'dbglass'
cask 'duet'
cask 'devdocs'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'google-chrome'
cask 'grammarly'
cask 'hyper'
cask 'iterm2'
cask 'kap'
cask 'now'
cask 'rectangle'
cask 'rocket'
cask 'sketch'
cask 'skitch'
cask 'slack'
cask 'steam'
cask 'suspicious-package'
cask 'transmit'
cask 'plug'
cask 'proxyman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'xscope'


