cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'broot'
brew 'bottom' # 'btm' is the cli binary
brew 'cocogitto' # https://github.com/cocogitto/cocogitto
brew 'csvkit'
brew 'datasette' # https://github.com/simonw/datasette
brew 'diskonaut' # https://github.com/imsnif/diskonaut
brew 'dust' # https://github.com/bootandy/dust
brew 'eza' # https://github.com/eza-community/eza
brew 'fantastical' # https://flexibits.com/fantastical
brew 'fastfetch' # https://github.com/fastfetch-cli/fastfetch
brew 'fd'
brew 'fx'
brew 'fzf-make' # https://github.com/kyu08/fzf-make
brew 'gh'
brew 'git'
brew 'git-delta' # https://github.com/dandavison/delta
brew 'grex' # https://github.com/pemistahl/grex
brew 'gfold' # https://github.com/nickgerace/gfold
brew 'hyperfine' # https://github.com/sharkdp/hyperfine
brew 'jless' # https://jless.io/
brew 'jq'
brew 'keith/formulae/reminders-cli'
brew 'lazydocker'
brew 'lazygit'
brew 'lsd'
brew 'm-cli'
brew 'mas'
brew 'navi'
brew 'noahgorstein/tap/jqp' #JQ playground: https://github.com/noahgorstein/jqp
brew 'neovim'
brew 'nvm' # https://github.com/mhinz/neovim-remote
brew 'onefetch'
brew 'pyenv'
brew 'pnpm'
brew 'ripgrep'
brew 'sk'
brew 'so'
brew 'spotify_player' # https://github.com/aome510/spotify-player - Work demands music. On the CLI.
brew 'starship'
brew 'svn' #omg I need this to get the fonts
brew 'sqlite-utils' # https://sqlite-utils.datasette.io/en/stable
brew 'tlrc' # https://github.com/tldr-pages/tldr
brew 'tokei'
brew 'wget'
brew 'xh' # https://github.com/ducaale/xh
brew 'yt-dlp'
brew 'zoxide'

cask '1password'
cask 'appcleaner'
cask 'cap'
cask 'claude-code'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'google-chrome'
cask 'raycast'
cask 'slack'
cask 'spark'
cask 'warp'
cask 'xscope'
